この問題の再現を確認しました。
以下のテンプレートでplanを実行すると、差分の中に`Sensitive: true`な情報が表示されます。


```hcl
resource "sakuracloud_proxylb" "foobar" {
  name           = "foobar"
  plan           = 100
  vip_failover   = true
  gzip           = true
  timeout        = 10
  region         = "is1"

  health_check {
    protocol    = "http"
    delay_loop  = 10
    host_header = "www.nekowaf.ns-testing.example.org"
    path        = "/"
  }

  bind_port {
    proxy_mode = "http"
    port       = 80
    response_header {
      header = "Cache-Control"
      value  = "public, max-age=10"
    }
  }

  certificate {
    server_cert = file("./fixture/server.crt")
    private_key = file("./fixture/server.key")
    intermediate_cert = file("./fixture/chain.crt")
  }

  server {
    ip_address = "49.212.XXX.XXX"
    port       = 80
    group      = "group1"
  }
  rule {
    host  = "www.nekowaf.ns-testing.example.org"
    path  = "/"
    group = "group1"
  }

  description = "description"
  tags        = ["tag1", "tag2"]
}


```



```shell
  # sakuracloud_proxylb.foobar will be created
  + resource "sakuracloud_proxylb" "foobar" {
      + backend_http_keep_alive = "safe"
      + description             = "description"
      + fqdn                    = (known after apply)
      + gzip                    = true
      + id                      = (known after apply)
      + letsencrypt             = (known after apply)
      + name                    = "foobar"
      + plan                    = 100
      + proxy_networks          = (known after apply)
      + region                  = "is1"
      + tags                    = [
          + "tag1",
          + "tag2",
        ]
      + timeout                 = 10
      + vip                     = (known after apply)
      + vip_failover            = true

      + bind_port {
          + port       = 80
          + proxy_mode = "http"

          + response_header {
              + header = "Cache-Control"
              + value  = "public, max-age=10"
            }
        }

      + certificate {
          + common_name       = (known after apply)
          + intermediate_cert = <<-EOT
                -----BEGIN CERTIFICATE-----
                MIIFBTCCAu2gAw...........   (output omitted...)
            EOT
          + private_key       = (sensitive value)
          + server_cert       = <<-EOT
                -----BEGIN CERTIFICATE-----
                MIIFTjCCBDagAwIB............ (output omitted....)
                -----END CERTIFICATE-----
            EOT
          + subject_alt_names = (known after apply)
        }

      + health_check {
          + delay_loop  = 10
          + host_header = "www.nekowaf.ns-testing.example.org"
          + path        = "/"
          + protocol    = "http"
        }

      + rule {
          + action = "forward"
          + group  = "group1"
          + host   = "www.nekowaf.ns-testing.example.org"
          + path   = "/"
        }

      + server {
          + enabled    = true
          + group      = "group1"
          + ip_address = "49.212.XXX.XXX"
          + port       = 80
        }
    }
```



値を文字列(手打ち or 変数の参照)で指定した場合には、きちんとマスクされます。
従って、terraform の [file](https://developer.hashicorp.com/terraform/language/functions/file)関数を噛ませることで、データが機密情報であるかどうかを判断せずに値として展開してしまう挙動があるようです。

repeatedly さんの[パッチ](https://github.com/sacloud/terraform-provider-sakuracloud/pull/1271)を用いると、同様のテンプレートでplanする場合でもこの問題が再現しません。
